<a href="https://colab.research.google.com/github/Jiablero/Disasters/blob/master/Empress_of_Ireland_season1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Сбор данных по списку пассажиров и команды "Императрицы Ирландии", находившихся на борту во время катастрофы 29 января 1904 года.

https://ru.wikipedia.org/wiki/Empress_of_Ireland

Первоначальные данные взяты отсюда: https://www.liverpoolmuseums.org.uk/empress-of-ireland-disaster

В данных по команде вручную был добавлен разделитель между именем и должностью

In [24]:
import pandas as pd
import numpy as np

In [60]:
crew = pd.read_csv('/content/drive/My Drive/disasters/emp_ir_crew.txt', sep = ';', index_col = False)

In [116]:
# * перед именем в изначальных данных обозначает выживших. Во всех таблицах. Сделаем функцию.

def ExtractSurvivedData(df, extractfield = 'Name'):
  df['Survived'] = df[extractfield].str.extract('^(\*)')
  df[extractfield][df.Survived == '*'] = df[extractfield].str.slice(1)
  df.Survived = np.where(df.Survived == '*', 1, 0)
  return df

# в списках пассажиров надо достать возраст из скобочек. 
def ExtractAgeData(df, extractfield = 'Name'):
  df['Age'] = df[extractfield].str.extract('\(.*(age\s*\d+)')
  df.Age = df.Age.str.slice(3) # убираем слово age
  df.Age[df.Age.isna()] = -1 # заменяем NA на -1 
  df.Age = df.Age.astype(int)
  # теперь надо убрать данные о возрасте из той колонки где мы их взяли
  df[extractfield] = df[extractfield].str.replace('age\s*\d+', '').str.replace('\(\s*\)', '')
  return df

In [61]:
crew = ExtractSurvivedData(crew)
crew['Class'] = 'Crew'

In [62]:
print('Выживших:', crew.Survived[crew.Survived == 1].count(), \
      'Погибших:', crew.Survived[crew.Survived == 0].count(), \
      '% выживших:', crew.Survived.mean())

Выживших: 233 Погибших: 187 % выживших: 0.5547619047619048

In [63]:
# у команды возраст не указан. Предположим что в среднем он был около 30, 
# т.к. в команде только трудоспособные персонажи, наверное от 20 до 50 лет примерно
crew['Age'] = 30

In [64]:
crew[crew.Survived == 1]

                          Name                Position  Survived Class  Age
0        Kendall, Henry George                  Master         1  Crew   30
2           Jones, Edward John           First Officer         1  Crew   30
4                 File, Osmond    Extra Second Officer         1  Crew   30
7              Ferguson Ronald            Telegraphist         1  Crew   30
8              Bamford, Edward            Telegraphist         1  Crew   30
..                         ...                     ...       ...   ...  ...
413  McDonnell, Michael Joseph           Chief Butcher         1  Crew   30
414             Knight, Robert          Second Butcher         1  Crew   30
415             Dawson, Alfred           Third Butcher         1  Crew   30
416             Paterson, John          Fourth Butcher         1  Crew   30
417             Bishop, Thomas   Assistant Ship’s Cook         1  Crew   30

[233 rows x 5 columns]

In [118]:
# 1st Class passengers
class1 = pd.read_csv('/content/drive/My Drive/disasters/emp_ir_1st.txt', sep = ';', \
                     index_col = False, header=None, names = ['Name'])

In [119]:
class1 = ExtractSurvivedData(class1)
class1 = ExtractAgeData(class1)
class1['Class'] = '1st Class'
class1['Position'] = 'Passenger'

In [120]:
print('Выживших:', class1.Survived[class1.Survived == 1].count(), \
      'Погибших:', class1.Survived[class1.Survived == 0].count(), \
      '% выживших:', class1.Survived.mean())

Выживших: 33 Погибших: 54 % выживших: 0.3793103448275862

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  del sys.path[0]

In [123]:
#2nd Class passengers
class2 = pd.read_csv('/content/drive/My Drive/disasters/emp_ir_2nd.txt', sep = ';', \
                     index_col = False, header=None, names = ['Name'])

In [124]:
class2 = ExtractSurvivedData(class2)
class2 = ExtractAgeData(class2)
class2['Class'] = '2nd Class'
class2['Position'] = 'Passenger'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  del sys.path[0]

In [125]:
print('Выживших:', class2.Survived[class2.Survived == 1].count(), \
      'Погибших:', class2.Survived[class2.Survived == 0].count(), \
      '% выживших:', class2.Survived.mean())

Выживших: 50 Погибших: 205 % выживших: 0.19607843137254902

In [126]:
#3rd Class passengers
class3 = pd.read_csv('/content/drive/My Drive/disasters/emp_ir_3d.txt', sep = ';', \
                     index_col = False, header=None, names = ['Name'])

In [127]:
class3 = ExtractSurvivedData(class3)
class3 = ExtractAgeData(class3)
class3['Class'] = '3rd Class'
class3['Position'] = 'Passenger'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  del sys.path[0]

In [128]:
print('Выживших:', class3.Survived[class3.Survived == 1].count(), \
      'Погибших:', class3.Survived[class3.Survived == 0].count(), \
      '% выживших:', class3.Survived.mean())

Выживших: 136 Погибших: 578 % выживших: 0.19047619047619047

In [131]:
total = crew.append(class1).append(class2).append(class3)

In [133]:
print('Выживших:', total.Survived[total.Survived == 1].count(), \
      'Погибших:', total.Survived[total.Survived == 0].count(), \
      '% выживших:', total.Survived.mean())

Выживших: 452 Погибших: 1024 % выживших: 0.3062330623306233

In [156]:
# Пытаемся разобраться с полом. По умолчанию назначаем всех мужчинами и пытаемся выбрать оттуда женщин
total['Sex'] = 'Male'
total.Sex[total.Name.str.find('Mrs') != -1] = 'Female'
total.Sex[total.Name.str.find('Miss') != -1] = 'Female'
total.Sex[total.Position == ' Stewardess'] = 'Female'
total.Sex[total.Position == ' Matron'] = 'Female'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [157]:
print('Мужчин:', total.Sex[total.Sex == 'Male'].count(), 'Женщин:', total.Sex[total.Sex == 'Female'].count())

Мужчин: 1079 Женщин: 397

In [169]:
# неправдоподобные цифры. Надо искать дальше. Посмотрим на детей.
total[total.Age < 16]
# нет, тут все отлично, титулы указаны.

                              Name   Position  Survived      Class  Age     Sex
24       Miss Isobel Maude Cullen   Passenger         0  1st Class    6  Female
25    Master Albert Edward Cullen   Passenger         0  1st Class    2    Male
26    Miss Jennie P. Blythe, nurse  Passenger         1  1st Class   -1  Female
65            Miss Eileen Mullins   Passenger         0  1st Class    9  Female
68    Miss Josephine Helen O’Hara   Passenger         0  1st Class   10  Female
..                             ...        ...       ...        ...  ...     ...
705              Mr Marczin Zaleva  Passenger         0  3rd Class   -1    Male
707                   Mr A. Zsuffa  Passenger         0  3rd Class   -1    Male
710          Master Wladislaw Zuk   Passenger         0  3rd Class    6    Male
711               Miss Josefa Zuk   Passenger         0  3rd Class    5  Female
713               Mr Toader Zrotam  Passenger         0  3rd Class   -1    Male

[380 rows x 6 columns]

Читаем в википедии:
" Спасти удалось только 463 человека, среди которых оказалось только четверо детей (из 134 имевшихся на борту) и 42 женщины (из 279 имевшихся на борту) "

Но у нас получается даже больше. Но, возможно, девочек не относили к женщинам.

In [167]:
# Почти точное попадание! Ура! Можно считать датасет удался!
total.Sex[(total.Sex == 'Female') & (total.Age > 18)].count()

280

In [171]:
# таким образом у нас получился общий датасет по всем категориям. 
# держим в уме пропущенные значения в Age == -1
total.to_csv('/content/drive/My Drive/disasters/emp_ireland.csv', index=False)